HCHCHC99/ota_ddl3.3/ota_ddl3.3_v.1.1/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Bootloader_App/Bootloader_App.h
#ifndef __BOOTLOADER_APP_H__
#define __BOOTLOADER_APP_H__

#include "hc32_ll.h"
#include "core_cm4.h"
#include <string.h>

// ###########################################################################
//
//                          ����ʽ�㡿�汾������
//
// ###########################################################################
#define BOOTLOADER_VERSION             "2.00_AB"

// ###########################################################################
//
//                          ����ʽ�㡿Flash ��ַӳ��
//
// ###########################################################################
// ����RAM���򣨸������ṩ�ĵ�ַ��
#define RAM_START_ADDR      0x1FFF8000UL
#define RAM_SIZE            0x2F000UL    // 188KB
#define RAM_END_ADDR        (RAM_START_ADDR + RAM_SIZE)

#define APP1_START_ADDR                  0x1A000
#define APP2_START_ADDR                  0x4C000
#define APP_RUN_SLOT_ADDR                0x7C000

#define APP1_STATE_SECTOR_BASE           0x16000
#define APP2_STATE_SECTOR_BASE           0x18000

#define WDT_COUNT_APP1_ADDR              (APP1_STATE_SECTOR_BASE + 0x008)
#define WDT_FEED_CONTROL_APP1_ADDR       (APP1_STATE_SECTOR_BASE + 0x000)
#define WDT_COUNT_APP2_ADDR              (APP2_STATE_SECTOR_BASE + 0x008)
#define WDT_FEED_CONTROL_APP2_ADDR       (APP2_STATE_SECTOR_BASE + 0x000)

#define SLOT_A_MAGIC                     0x5A5A5A5Au
#define SLOT_B_MAGIC                     0xA5A5A5A5u
#define MAX_WDT_RESET_COUNT              3
#define WDT_FEED_ENABLE                  0x00000000u
#define WDT_FEED_DISABLE                 0xDEADBEEFu

#define MEM_ZERO_STRUCT(x)               memset(&(x), 0, sizeof(x))

// ###########################################################################
//
//                          ����ʽ�㡿ö�� & �ṹ��
//
// ###########################################################################
typedef uint32_t en_slot_type_t;
#define SLOT_NONE    ((en_slot_type_t)0)
#define SLOT_APP1    ((en_slot_type_t)SLOT_A_MAGIC)
#define SLOT_APP2    ((en_slot_type_t)SLOT_B_MAGIC)

typedef enum {
    APP_STATE_AVAILABLE = 0,
    APP_STATE_DISABLED = 1
} en_app_state_t;

typedef enum {
    WDT_RESET_NONE = 0,
    WDT_RESET_SWDT = 1,
    WDT_RESET_WDT = 2
} en_wdt_reset_type_t;

typedef enum {
    BOOT_STATUS_NORMAL = 0,
    BOOT_STATUS_APP1_DISABLED = 1,
    BOOT_STATUS_APP2_DISABLED = 2,
    BOOT_STATUS_BOTH_DISABLED = 3
} en_boot_status_t;

typedef struct {
    en_slot_type_t eSlot;
    uint32_t u32WdtCount;
    en_app_state_t eState;
    uint32_t u32StartAddr;
} stc_app_info_t;

typedef struct {
    en_wdt_reset_type_t eWdtResetType;
    en_slot_type_t eCurrentSlot;
    en_slot_type_t eTargetSlot;
    stc_app_info_t stcApp1;
    stc_app_info_t stcApp2;
    uint8_t u8NeedUpdateSlotFlag;
} stc_boot_context_t;

// ###########################################################################
//
//                          ����ʽ�㡿����RAM ���ƽṹ
//
// ###########################################################################
#define SHARED_RAM_BASE_ADDR             0x1FFF8000
#define SHARED_CTRL_OFFSET               0x2F000
#define SHARED_CTRL_ADDR                 (SHARED_RAM_BASE_ADDR + SHARED_CTRL_OFFSET - 0x100)

typedef struct {
    volatile uint32_t app1_feed_ctrl;
    volatile uint32_t app2_feed_ctrl;
    volatile uint32_t debug_flag;
    volatile uint32_t reserved[5];
} stc_shared_ctrl_t;

static inline stc_shared_ctrl_t* GetSharedCtrl(void)
{
    return (stc_shared_ctrl_t*)SHARED_CTRL_ADDR;
}

// ###########################################################################
//
//                          ����ʽ�㡿����ӿں���
//
// ###########################################################################
void Bootloader_Main(void);                // Bootloader �����
void APP1_Main(void);                      // APP1 �������
void APP2_Main(void);                      // APP2 �������

void InitSharedCtrl(void);
void Bootloader_Init(void);
int32_t Bootloader_FlashEraseSector(uint32_t u32Addr);
void DisableAllNVICInterrupts(void);
void Bootloader_JumpToApp(uint32_t u32AppAddr);
void APP_SwitchAndRunOther(void);
void Bootloader_Delay(uint32_t u32Count);

uint32_t GetWdtResetCount(uint32_t u32Addr);
void UpdateWdtResetCount(uint32_t u32Addr, uint32_t u32CurrentCount);
void ClearWdtResetCount(uint32_t u32Addr);

void SetWdtFeedControl(uint32_t u32Addr, uint32_t u32Value);
uint32_t GetWdtFeedControl(uint32_t u32Addr);
void ClearAppStateBySlot(en_slot_type_t eSlot);
uint32_t READ_FLASH_DIRECT(uint32_t addr);


void ClearAllRAM(void);

#endif
